// https://en.wikipedia.org/wiki/Unification_(computer_science)
// 컴퓨터 과학에서의 "Unification(통일화)"은 주로 논리 및 프로그래밍 언어 분야에서 사용되는 개념입니다.
//  통일화는 주어진 식에서 변수들 간의 관계를 찾거나 두 개의 식을 하나로 만들어 주는 프로세스입니다.

// 주로 프로그래밍 언어의 타입 시스템에서나 논리 프로그래밍에서 사용됩니다. 
// 여기서 타입 시스템에서는 변수나 표현식의 타입이나 속성에 관한 제약을 정의하며, 
// 통일화는 이러한 제약을 충족시키기 위해 사용됩니다.

// 논리 프로그래밍에서 통일화는 주어진 논리식이나 규칙을 다른 논리식에 적용할 때 사용됩니다. 
// 이를 통해 변수들 간의 관계를 발견하거나 식을 단순화하여 논리적으로 다룰 수 있게 됩니다.

// $x = 5$와 $x + y = 10$이라는 두 개의 식이 주어졌을 때, 통일화를 통해 $y$의 값을 찾을 수 있습니다. 
// 여기서 $y = 5$가 됩니다.
// Prolog와 같은 논리 프로그래밍 언어에서, 
// 규칙에 대한 통일화를 통해 입력된 질의와 일치하는 규칙을 찾을 수 있습니다.